# IsTagCategory Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Category..::..IsTagCategory Property
Category Class See Also
---
Identifies if the category is associated with a type of tag for a different category.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public bool IsTagCategory { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsTagCategory As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsTagCategory {
	bool get ();
}
```

# ### Field Value
True if the category is associated with a type of tag for a different category, false if not.
# See Also
Category Class
Autodesk.Revit.DB Namespace